#!/usr/bin/python3
# 汜水关
# https://mp.weixin.qq.com/s/Z2sk76vvtbBGGo6abKTnPw
# 存档名：0-1
# 战前准备——卖掉青龙偃月刀和丈八蛇矛买道具
# 刘备：2本焦热书5个豆一壶酒
# 关羽：8本焦热书
# 张飞：5本焦热书3个豆
from sys import path
path.append('../')
from sgzyjz import main

d = [2]*30
r = [0]*30
# 第一回合：张飞下1左5休息，关羽左4上1休息，刘备左3下1休息。
r[0] = (
    ('zf', (-5, 1), 'rest'),
    ('gy', (-4, -1), 'rest'),
    ('lb', (-3, 1), 'rest'),
)
# 第二回合：张飞左1下1平A，刘备左4平A，关羽左3下1带走敌军。
r[1] = (
    ('zf', (-1, 1), 'attack', (0, -1)),
    ('lb', (-4, 0), 'attack', (-1, 0)),
    ('gy', (-3, 1), 'attack', (1, 0)),
)
d[1] = 4
# 第三回合：张飞左1下1进村庄平A敌军，刘备左1下1平A，关羽原地攻击带走第二个步兵。
r[2] = (
    ('zf', (-1, 1), 'attack', (0, -1)),
    ('lb', (-1, 1), 'attack', (-1, 0)),
    ('gy', (0, 0), 'attack', (0, 1)),
)
d[2] = 3
# 第四回合：张飞左2上3站在鹿寨下休息，刘备左3上1站在张飞下休息，关羽原地A敌军。
r[3] = (
    (('zf', (0, 1)), (-2, -3), 'rest'),
    ('lb', (-3, -1), 'rest'),
    ('gy', (0, 0), 'attack', (1, 0)),
)
d[3] = 6
# 第五回合：张飞下2左2攻击李肃，关羽左3攻击李肃，刘备上1右3攻击步兵。
r[4] = (
    ('zf', (-2, 2), 'attack', (0, -1)),
    ('gy', (-3, 0), 'attack', (-1, 0)),
    ('lb', (3, -1), 'attack', (0, 1)),
)
d[4] = 4
# 第六回合：关羽左1平A李肃，张飞右3上2攻击赵岑，刘备上1左1攻击赵岑。
r[5] = (
    ('gy', (-1, 0), 'attack', (0, -1)),
    ('zf', (3, -2), 'attack', (1, 0)),
    ('lb', (-1, -1), 'attack', (0, 1)),
)
d[5] = 4
# 第七回合：张飞右1下1攻击步兵，关羽下1右3带走步兵，刘备左1上1休息。
r[6] = (
    ('zf', (1, 1), 'attack', (-1, 0)),
    ('gy', (3, 1), 'attack', (0, -1)),
    ('lb', (-1, -1), 'rest'),
)
d[6] = 4
# 第八回合：张飞原地攻击赵岑，关羽左2上3攻击李肃，刘备左1上1休息。
r[7] = (
    ('zf', (0, 0), 'attack', (0, 1)),
    ('gy', (-2, -3), 'attack', (1, 0)),
    ('lb', (-1, -1), 'rest'),
)
d[7] = 4
# 第九回合：关羽左6攻击胡轸，张飞左3上2攻击李肃，刘备原地吃豆恢复兵力。
r[8] = (
    ('gy', (-6, 0), 'attack', (0, 1)),
    ('zf', (-3, -2), 'attack', (1, 0)),
    ('lb', (0, 0), ('item', 'use', 0)),
)
d[8] = 6
# 第十回合：刘备左1下1休息，张飞上1右1攻击李肃，关羽原地攻击胡轸。
r[9] = (
    ('lb', (-1, 1), 'rest'),
    ('zf', (1, -1), 'attack', (0, 1)),
    (('gy', (-3, 0)), (0, 0), 'attack', (0, 1)),
)
d[9] = 4
# 第十一回合：张飞原地攻击李肃，关羽右6攻击李肃，刘备原地使用酒恢复士气。
r[10] = (
    ('zf', (0, 0), 'attack', (0, 1)),
    (('gy', (-3, 0)), (6, 0), 'attack', (1, 0)),
    ('lb', (0, 0), ('item', 'use', 5)),
)
# 第十二回合：刘备原地使用豆恢复张飞兵力，张飞原地攻击李肃，关羽下4右2攻击赵岑。
r[11] = (
    ('lb', (0, 0), ('item', 'use', 2), (1, 0)),
    ('zf', (0, 0), 'attack', (0, 1)),
    ('gy', (2, 4), 'attack', (1, 0)),
)
d[11] = 4
# 第十三回合：关羽左2上4攻击李肃，张飞原地攻击李肃，刘备原地使用豆给关羽恢复兵力。
r[12] = (
    (('gy', (0, 1)), (-2, -4), 'attack', (1, 0)),
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (0, 0), ('item', 'use', 2), (0, 1)),
)
# 第十四回合：关羽下3右3攻击赵岑，张飞原地攻击李肃，刘备下1攻击李肃。
r[13] = (
    ('gy', (3, 3), 'attack', (0, 1)),
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (0, 1), 'attack', (1, 0)),
)
d[13] = 4
# 第十五回合：关羽原地攻击赵岑，刘备下1右2攻击李肃，张飞右1攻击李肃。
r[14] = (
    ('gy', (0, 0), 'attack', (0, 1)),
    ('lb', (2, 1), 'attack', (0, -1)),
    ('zf', (1, 0), 'attack', (0, 1)),
)
d[14] = 4
# 第十六回合：张飞左1休息，刘备上2休息，关羽原地攻击赵岑。
r[15] = (
    # ('zf', (-1, 0), 'rest'),
    ('zf', (-1, 0), 'attack', (0, 1)),
    ('lb', (0, -2), 'rest'),
    ('gy', (0, 0), 'attack', (0, 1)),
)
d[15] = 4
# 第十七回合：关羽左3上3攻击李肃，张飞原地攻击李肃，刘备上1到粮仓给自己使用豆恢复兵力，并获取一颗豆。
# 这里有问题，会因为恢复的不同有不同结果，这里如果 zf 再打一下就死了，所以先休息
r[16] = (
    ('gy', (-3, -3), 'attack', (1, 0)),
    # ('zf', (0, 0), 'attack', (0, 1)),
    ('zf', (0, 0), 'rest'),
    ('lb', (0, -1), ('item', 'use', 2)),
)
d[16] = 3
# 第十八回合：关羽左6带走胡轸（注意，这时关羽的经验值是2.96，带走胡轸可以得到38点经验），张飞原地攻击李肃，刘备左1休息。
r[17] = (
    ('gy', (-6, 0), 'attack', (0, 1)),
    ('zf', (1, 0), 'attack', (0, 1)),
    ('lb', (-1, 0),  ('item', 'use', 2), (1, 1)),
)
# 第十九回合：关羽原地使用焦热书烧华雄（从这回合开始必须连续三回合晴天，否则撤退重开），张飞原地攻击李肃，刘备左1下2攻击李肃（李肃本回合可能待在鹿砦不动，也有可能右1攻击张飞，具体情况可以自己操作，不影响大局）。
r[18] = (
    (('gy', (-3, 0)), (0, 0), ('item', 'use', 0), (-1, 1)),
    ('zf', (-1, 0), 'attack', (0, 1)),
    ('lb', (-1, 1), 'rest'),
)
# 第二十回合：张飞右1攻击李肃，刘备右1上2使用豆给张飞恢复兵力，关羽原地使用焦热书烧华雄。
r[19] = (
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (0, 1), 'attack', (1, 0)),
    (('gy', (-3, 0)), (0, 0), ('item', 'use', 0), (-1, 1)),
)
# 第二十一回合：关羽原地使用焦热书烧华雄，张飞左1攻击李肃，刘备原地休息。
r[20] = (
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (1, -2), 'rest'),
    (('gy', (-3, 0)), (0, 0), ('item', 'use', 0), (-1, 1)),
)
# 第二十二回合：关羽右6攻击李肃，张飞原地攻击李肃，刘备原地休息。
r[21] = (
    (('gy', (-3, 0)), (6, 0), 'attack', (1, 0)),
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (0, 0), 'rest'),
)
# 第二十三回合：张飞原地攻击李肃，关羽原地攻击李肃（千万不能击退李肃，这就是晴天的好处，李肃在鹿砦内血量恢复较多，碰到雨天可能不够两位大侠砍的），刘备原地休息。
r[22] = (
    ('gy', (0, 0), 'attack', (1, 0)),
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (0, 0), 'rest'),
)
# 第二十四回合：关羽下4右2攻击赵岑，张飞原地攻击李肃，刘备右1下1休息。
r[23] = (
    ('gy', (2, 4), 'attack', (1, 0)),
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (1, 1), 'rest'),
)
d[23] = 4
# 第二十五回合：关羽左2上4攻击李肃，张飞原地攻击李肃，刘备原地使用豆恢复兵力。
r[24] = (
    (('gy', (0, 1)), (-2, -4), 'attack', (1, 0)),
    ('zf', (0, 0), 'attack', (0, 1)),
    ('lb', (0, 0), ('item', 'use', 2)),
)
# 第二十六回合：刘备右1下1休息吸引赵岑，张飞原地攻击李肃，关羽原地攻击李肃。
r[25] = (
    ('gy', (0, 0), 'attack', (1, 0)),
    ('zf', (0, 0), 'rest'),
    ('lb', (1, 1), 'rest'),
)
d[25] = 4
# 第二十七回合：刘备原地攻击赵岑，张飞右3下2攻击赵岑，关羽下1右2击退赵岑升到4级。
r[26] = (
    ('zf', (3, 2), 'attack', (-1, 0)),
    ('lb', (0, 0), 'attack', (0, 1)),
    ('gy', (2, 1), 'attack', (1, 0)),
)
# # 第二十八回合：张飞左2上1攻击李肃，刘备上1左2攻击李肃，关羽左2上1攻击李肃。
r[27] = (
    ('zf', (-2, -1), 'attack', (-1, 0)),
    ('lb', (-2, -1), 'attack', (0, 1)),
    ('gy', (-2, -1), 'attack', (1, 0)),
)
# 第二十九回合：张飞左1进鹿砦攻击李肃，刘备左4直奔宝物库，关羽下1击退李肃。
r[28] = (
    ('zf', (-1, 0), 'attack', (0, 1)),
    ('lb', (-4, 0), 'rest'),
    ('gy', (0, 1), 'attack', (1, 0)),
)
# 第三十回合：刘备左1进宝物库得到黄金100两，张飞左5交给刘备一颗豆，关羽左6直奔华雄单挑。
r[29] = (
    ('lb', (-1, 0), 'rest'),
    ('zf', (-5, 0), ('item', 'send', 2), (0, -1)),
    ('gy', (-6, 0), 'attack', (-1, 0)),
)

main(
    "D:\Games\sgzyjz\start.exe",
    ('lb', 'gy', 'zf'),
    rnd_list=r,
    delay_list=d,
    start=0,
    debug=0
)
