#!/usr/bin/python3
# 信都之战
# https://mp.weixin.qq.com/s/UOIK-gm8m_6wtzhyX-chmw
# 存档名：1-1
# 本关注意事项：
# 1、本关第二回合，淳于琼必须出来牵制村中的张飞，否则需要撤退重来（真是个碰运气的回合，关羽的开场白已经让我背会了图片图片图片）。
# 2、关羽8级以后尽量接触军乐队，补充策略值，最好是挨着军乐队的同时牵制淳于琼或军乐队。
# 3、第十四回合淳于琼会主动出击，一定要让出村庄的位置给他，让淳于琼在村中休息并牵制简雍，或攻击关羽。
# 4、布阵完成后，淳于琼大于400HP，由关羽和刘备完成攻击，小于400HP，由简雍和刘备攻击，关羽牵制为主。
# 5、刘备在27或28回合时主动向城门靠近，由关羽和简雍控制淳于琼，让他的血量保持红色，一般其不会再出村。
# 刘备：1浓雾书4豆1酒
# 关羽：
# 张飞：3豆1酒
# 简雍：4豆1酒1浓雾书
# 出兵顺序：简雍→关羽→张飞
from sys import path
path.append('../')
from sgzyjz import main

d = [4]*30
r = [0]*30
# 第一回合：简雍左4休息，关羽左5上1休息，刘备左4休息，张飞左6休息。
r[0] = (
    (('jy', (4, 0)), (-4, 0), 'rest'),
    (('gy', (4, 2)), (-5, -1), 'rest'),
    (('lb', (5, 1)), (-4, 0), 'rest'),
    (('zf', (5, -1)), (-6, 0), 'rest'),
)
d[0] = 1
# 第二回合：张飞左4进村休息，关羽左2上4攻击骑兵，简雍左4在村庄右下角休息，刘备左2上2休息。这回合淳于琼必须到张飞左上角牵制张飞，否则退兵重开。
r[1] = (
    (('zf', (0, -1)), (-4, 0), 'rest'),
    (('gy', (0, 1)), (-2, -4), 'attack', (-1, 0)),
    (('jy', (0, 0)), (-4, 0), 'rest'),
    (('lb', (1, 1)), (-2, -2), 'rest'),
)
d[1] = 7
# 第三回合：关羽下1右1吃掉骑兵，张飞右2上2攻击4级步兵，简雍右1上2攻击4级步兵，刘备左1上1休息。
r[2] = (
    (('gy', (0, -3)), (-1, 1), 'attack', (-1, 0)),
    (('zf', (0, -1)), (2, -2), 'attack', (-1, 0)),
    (('jy', (0, 0)), (1, -2), 'attack', (-1, -1)),
    (('lb', (0, -1)), (-1, -1), 'rest'),
)
d[2] = 4
# 第四回合：张飞下2右2进村庄攻击冲上来的骑兵，关羽原地攻击带走骑兵，简雍下1左1攻击4级步兵，刘备左1休息。
r[3] = (
    (('zf', (0, -3)), (-2, 2), 'attack', (0, -1)),
    (('gy', (0, -2)), (0, 0), 'attack', (-1, 0)),
    (('jy', (0, -2)), (-1, 1), 'attack', (0, -2)),
    (('lb', (0, -2)), (-1, 0), 'rest'),
)
d[3] = 6
# 第五回合：刘备原地攻击4级步兵，关羽上1带走4级步兵，升到8级学会牵制，张飞右4下1攻击下路4级步兵，简雍右1攻击贼兵。
r[4] = (
    (('lb', (0, -2)), (0, 0), 'attack', (0, -1)),
    (('gy', (0, -2)), (0, -1), 'attack', (1, 0), [(230, 255), (230, 255)]),
    (('zf', (0, -1)), (4, 1), 'attack', (0, 1)),
    (('jy', (0, -1)), (1, 0), 'attack', (1, -1)),
)
d[4] = 4
# 第六回合：张飞左1上1攻击贼兵，简雍下1右1攻击上方贼兵，刘备下1给自己使用豆恢复兵力，关羽下1右1带走上方贼兵。
r[5] = (
    (('zf', (0, 0)), (-1, -1), 'attack',
     (0, -1), [(300, 70), (300, 70), (300, 70)]),
    (('jy', (0, -1)), (1, 1), 'attack', (0, -2)),
    (('lb', (0, -2)), (0, 1), ('item', 'use', 0)),
    (('gy', (0, -3)), (1, 1), 'attack', (1, 0)),
)
d[5] = 3
# 第七回合：简雍左1攻击4级步兵，刘备原地使用豆给张飞恢复兵力，张飞下1攻击4级步兵，升到4级，关羽右1下1攻击贼兵。
r[6] = (
    (('jy', (0, 0)), (-1, 0), 'attack', (2, 0)),
    (('lb', (0, -1)), (0, 0), ('item', 'use', 0), (1, 0)),
    (('zf', (0, -1)), (0, 1), 'attack', (1, 0)),
    (('gy', (0, -2)), (1, 1), 'attack', (1, 0), [(300, 70), (300, 70), (300, 70)]
     ),
)
d[6] = 3
# 第八回合：简雍上1左2进入村庄攻击淳于琼，张飞左2休息，关羽下1带走4级步兵，刘备右1攻击贼兵。
r[7] = (
    (('jy', (0, 0)), (-2, -1), 'attack', (-1, -1)),
    (('zf', (0, 0)), (-2, 0), 'rest'),
    (('gy', (0, -1)), (0, 1), 'attack', (1, 0)),
    (('lb', (0, -1)), (1, 0), 'attack', (1, 0),
     [(300, 70), (300, 70), (300, 70)]),
)
d[7] = 6
# 第九回合：刘备左2上2在军乐队右上方休息，关羽左2上2对军乐队使用牵制，简雍原地射淳于琼，张飞右3攻击贼兵。
r[8] = (
    (('gy', (0, 0)), (-2, -2), ('strategy', 0), (-1, 0)),
    (('lb', (0, -1)), (-2, -2), 'rest'),
    (('jy', (0, -1)), (0, 0), 'attack', (-1, -1)),
    (('zf', (0, 0)), (3, 0), 'attack', (0, -1),
     [(300, 70), (300, 70), (300, 70)]),
)
d[8] = 6
# 第十回合：关羽右2下1吃掉贼兵，刘备左1原地休息，简雍原地攻击淳于琼，张飞下3左3过桥使用豆给自己恢复兵力。
r[9] = (
    (('gy', (0, -2)), (2, 1), 'attack', (1, 0)),
    (('jy', (0, -1)), (0, 0), 'attack', (-1, -1)),
    # (('lb', (0, -3)), (0, 2), ('item', 'use', 2), (-1, 0)),
    (('lb', (0, -3)), (0, 0), 'rest'),
    # (('zf', (0, 0)), (-3, 3), ('item', 'use', 0)),
    (('zf', (0, 0)), (-3, 0), ('item', 'use', 3), (-1, -1)),
)
d[9] = 4
# 第十一回合：简雍原地射击淳于琼，关羽左2上1牵制军乐队，刘备原地休息，张飞左4上2休息。
r[10] = (
    (('jy', (0, -1)), (0, 0), 'attack', (-1, -1)),
    (('gy', (0, -1)), (-2, -1), ('strategy', 0), (-1, 0)),
    (('lb', (0, -3)), (0, 0), 'rest'),
    # (('zf', (0, 3)), (-4, -2), 'rest'),
    (('zf', (0, 0)), (3, 3), ('item', 'use', 0)),
)
d[10] = 3
# 第十二回合：关羽原地牵制军乐队，简雍原地射击淳于琼升到4级，张飞右1进宝物库得到酒，刘备右1休息。
r[11] = (
    (('gy', (0, -2)), (0, 0), ('strategy', 0), (-1, 0)),
    (('jy', (0, -1)), (0, 0), 'attack', (-1, -1)),
    (('lb', (0, -3)), (0, 0), 'rest'),
    # (('lb', (0, -3)), (0, 2), ('item', 'use', 2), (-1, 0)),
    (('zf', (0, 3)), (-6, 0), 'rest'),
)
d[11] = 4
# # 第十三回合：简雍原地射击淳于琼，关羽原地牵制军乐队，张飞下2左4使用酒给自己恢复士气，刘备原地休息。
r[12] = (
    (('gy', (0, -2)), (0, 0), ('strategy', 0), (-1, 0)),
    (('jy', (0, -1)), (0, 0), 'attack', (-1, -1)),
    (('lb', (0, -3)), (0, 0), 'rest'),
    (('zf', (0, 3)), (0, -2), 'rest'),
)
d[12] = 4
# 第十四回合：简雍右2上1休息，关羽下1牵制军乐队，刘备右2上2进树林休息。张飞左1休息。
r[13] = (
    (('zf', (0, 1)), (-4, 2), ('item', 'use', 0)),
    (('gy', (0, -2)), (0, 1), ('strategy', 0), (-1, -1)),
    (('jy', (0, -1)), (1, 1), 'rest'),
    # (('lb', (0, -3)), (0, 0), 'rest'),
    (('lb', (0, -3)), (2, -2), 'rest'),
)
d[13] = 3
# 第十五回合：简雍下1使用浓雾书混乱军乐队，关羽右1上1攻击淳于琼，刘备下2攻击淳于琼，张飞上4左2攻击弓箭手。
r[14] = (
    (('zf', (-2, 3)), (-1, 0), 'rest'),
    # (('zf', (-3, 3)), (-2, -4), 'attack', (0, -1)),
    (('gy', (0, -1)), (0, 0), ('strategy', 0), (-1, 0)),
    (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
    (('lb', (0, -5)), (-2, 2), 'attack', (0, 1)),
)
d[14] = 5
# # 第十六回合：刘备左2休息，简雍下1左1休息，引诱淳于琼牵制，关羽下1左1牵制军乐队，升到9级，张飞左1追杀弓箭手。
# r[15] = (
#     (('lb', (0, -2)), (0, 0), ('item', 'use', 0), (1, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     (('gy', (0, -1)), (0, 0), ('strategy', 0), (0, -1)),
#     (('zf', (-5, -1)), (-1, 0), 'attack', (-1, 0)),
# )
# d[15] = 5
# # 第十七回合：刘备左1下1攻击淳于琼，简雍原地射击淳于琼，关羽原地牵制军乐队，张飞左1杀死弓箭手。
# r[16] = (
#     (('zf', (-6, -1)), (0, 1), 'attack', (-1, 0)),
#     (('gy', (0, -1)), (0, 0), ('strategy', 0), (-1, 0)),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
# )
# d[16] = 3
# # 第十八回合：刘备原地给关羽使用豆恢复兵力，关羽原地攻击淳于琼，简雍原地休息，张飞右5休息。
# r[17] = (
#     (('zf', (-6, 0)), (4, -1), 'rest'),
#     (('gy', (0, -1)), (0, 0), ('strategy', 0), (-1, 0)),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
# )
# d[17] = 3
# # 第十九回合：张飞右1进入宝物库获得黄金100两图片，简雍原地射击淳于琼，刘备原地攻击淳于琼，关羽原地牵制淳于琼。
# r[18] = (
#     (('zf', (-2, -1)), (1, 0), 'rest'),
#     (('gy', (0, -1)), (0, 0), 'attack', (-1, 0)),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), ('item', 'use', 0), (0, -1)),
# )
# d[18] = 4
# # 第二十回合：张飞原地攻击来送死的4级步兵，刘备原地使用豆给关羽恢复兵力，关羽原地攻击淳于琼，简雍右1上1射击淳于琼。
# r[19] = (
#     (('zf', (-1, -1)), (0, 0), 'attack', (0, -1)),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     (('gy', (0, -1)), (0, 0), ('strategy', 0), (-1, 0)),
# )
# d[19] = 5
# # 第二十一回合：张飞上2攻击4级步兵，简雍原地射击淳于琼，刘备原地攻击淳于琼，关羽原地牵制淳于琼（这娃儿好惨图片）。
# r[20] = (
#     (('zf', (-1, -1)), (0, -2), 'attack', (0, 1)),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     # (('gy', (0, -1)), (0, 0), ('strategy', 0), (-1, 0)),
#     (('gy', (0, -1)), (0, 0), ('item', 'use', 0)),
# )
# d[20] = 4
# # 第二十二回合：张飞原地吃掉4级步兵，刘备原地使用酒给关羽恢复士气，关羽原地牵制淳于琼，简雍原地射击淳于琼。
# r[21] = (
#     (('zf', (-1, -3)), (0, 0), 'attack', (0, 1)),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     (('gy', (0, -1)), (0, 0), ('strategy', 0), (-1, 0)),
# )
# d[21] = 3
# # 第二十三回合：张飞右6把豆交给刘备，刘备原地给关羽使用豆恢复兵力，关羽原地攻击淳于琼（不超过380点血），简雍原地射击淳于琼，升到5级。
# r[22] = (
#     (('zf', (-1, -3)), (4, 1), ('item', 'send', 0), (1, 0)),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     (('gy', (0, -1)), (0, 0), ('item', 'use', 0)),
# )
# d[22] = 3
# # 第二十四回合：刘备原地攻击淳于琼，简雍原地射击淳于琼，关羽原地牵制淳于琼，张飞原地休息。
# r[23] = (
#     (('zf', (0, -2)), (0, 0), 'rest'),
#     (('lb', (0, -2)), (0, 0), ('item', 'use', 0), (1, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     (('gy', (0, -1)), (0, 0), 'rest'),
# )
# d[23] = 3
# # 第二十五回合：关羽原地牵制淳于琼，简雍原地射击淳于琼，刘备原地攻击淳于琼，张飞原地休息。
# r[24] = (
#     (('zf', (0, -2)), (0, 0), 'rest'),
#     (('lb', (0, -2)), (0, 0), 'attack', (0, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     (('gy', (0, -1)), (0, 0), ('strategy', 0), (0, -1)),
# )
# d[24] = 4
# 第二十六回合：张飞右1下1使用豆给关羽恢复兵力，关羽原地攻击淳于琼，简雍原地射击淳于琼，此时淳于琼仅剩65滴血，刘备要不要砍他呢？必须要，为啥不砍，14点经验呢！刘大耳朵原地继续砍他！砍了55滴血，我的心都在颤抖图片图片图片
# r[25] = (
#     (('zf', (0, -2)), (0, 0), ('item', 'send', 0), (1, 0)),
#     (('lb', (0, -2)), (0, 0), ('item', 'use', 0), (1, 1)),
#     (('jy', (0, 0)), (0, 0), 'attack', (-1, -1)),
#     (('gy', (0, -1)), (0, 0), 'rest'),
# )
# d[25] = 4
# 第二十七回合：刘备砍完一刀怕淳于琼报复，赶紧上1左3奔向城门，张飞一看大哥跑了上1左1紧跟大哥步伐，同时使用豆给自己恢复兵力，万一淳于琼那小子砍我呢？简雍可不管那么多，反正我跟你也没结拜，老子接着射！图片图片图片，关羽这时候为难了，走也不是打也不是，干脆原地休息吧！
# 第二十八回合：刘备左4快跑啊！简雍心想你大爷的，跑什么跑，老子一回合12点经验不香么？接着奏乐接着射！张飞右1下1跟着简雍混去了，这么不讲究吗？关羽原地休息。
# 第二十九回合：张飞：淳于琼你大爷，老子这关一回合没打你你还来打老子，打不了你我还躲不了你吗？最大距离开跑！随便哪里都行！简雍右2上2继续揍淳于琼，关羽右1上1牵制淳于琼，刘备左边随便，只要不进城门就行。
# 第三十回合：军乐队这时候睡醒了，简雍揍他，关羽收了军乐队，张飞接着跑，刘备进城门，全体50点经验到手图片图片图片


for st in range(len(r)):
    if r[st] == 0:
        break

main(
    "D:\Games\sgzyjz\start.exe",
    ('lb', 'jy', 'gy', 'zf'),
    rnd_list=r,
    delay_list=d,
    start=0,
    # start=st-1,
    # debug=1
)
