#!/usr/bin/python3
# 虎牢关
# https://mp.weixin.qq.com/s/Ul4xhhMf3kQAJYG_DWWrRQ
# 存档名：0-2
from sys import path
path.append('../')
from sgzyjz import main

d = [2]*30
r = [0]*30
# 第一回合：刘备上1左2把焦热书交给关羽，关羽左2上4休息，张飞左2上3在关羽左边把焦热书交给关羽。
r[0] = (
    (('lb', (5, 2)), (-2, -1), ('item', 'send', 0), (0, 1)),
    (('gy', (3, 2)), (-2, -4), 'rest'),
    (('zf', (2, 1)), (-2, -3), ('item', 'send', 0), (1, 0)),
)
# 第二回合：刘备左2上2把焦热书交给关羽，张飞右1上2攻击步兵，关羽上3左1击退步兵。
r[1] = (
    (('lb', (3, 1)), (-2, -2), ('item', 'send', 0), (0, -1)),
    ('zf', (1, -2), 'attack', (-1, 0)),
    (('gy', (1, 0)), (-1, -3), 'attack', (0, 1)),
)
d[1] = 5
# 第三回合：刘备左2上2攻击弓箭手，张飞左1攻击弓箭手，关羽左1击退弓箭手。
r[2] = (
    (('lb', (1, 0)), (-2, -2), 'attack', (0, -1)),
    (('zf', (1, 0)), (-1, 0), 'attack', (-1, 0)),
    ('gy', (-1, 0), 'attack', (0, 1)),
)
# 第四回合：刘备上3攻击宋宪，关羽右1攻击宋宪，张飞右2下2进入村庄休息。
r[3] = (
    ('lb', (0, -3), 'attack', (1, 0)),
    ('gy', (1, 0), 'attack', (0, -1)),
    ('zf', (2, 2), 'rest'),
)
d[3] = 6
# 第五回合：张飞左1上3使用焦热书烧宋宪（让虚血的宋宪进入村庄休息，不要打死他，养着），刘备左1上2攻击弓箭手，关羽上3击退弓箭手。
r[4] = (
    (('zf', (2, 0)), (-1, -3), ('item', 'use', 0), (1, 1)),
    ('lb', (-1, -2), 'attack', (1, 0)),
    ('gy', (0, -3), 'attack', (-1, 0)),
)
# 第六回合：张飞左3上1攻击侯成，刘备原地在村庄攻击侯成，关羽左3下1击退侯成，升到6级。
r[5] = (
    (('zf', (1, 0)), (-3, -1), 'attack', (0, -1)),
    ('lb', (0, 0), 'attack', (0, 1)),
    ('gy', (-3, 1), 'attack', (1, 0)),
)
# 第七回合：关羽上6来到吕布右下角使用焦热书烧吕布（此回合必须是晴天，否则撤兵重开），刘备右3上1休息，张飞上2进入村庄休息。
r[6] = (
    ('gy', (0, -6), ('item', 'use', 0), (-1, -1)),
    ('lb', (3, -1), 'rest'),
    ('zf', (0, -2), 'rest'),
)
# 第八回合：张飞上2休息，刘备右2进入宝物库得焦热书，关羽原地使用焦热书烧张辽。
r[7] = (
    ('zf', (0, -2), 'rest'),
    (('lb', (1, 0)), (2, 0),  'rest'),
    ('gy', (0, 0), ('item', 'use', 0), (-1, 0)),
    # ('gy', (0, 0), 'attack', (-1, 0)),
)
# 第九回合：关羽右1下1攻击张辽，张飞下6休息（吸引张辽进入村庄休息，养着张辽不要杀死），刘备下1右1进入粮仓休息，得到一颗豆。
r[8] = (
    ('gy', (1, 1), 'attack', (0, 1)),
    # ('gy', (1, 1),  ('item', 'use', 0), (0, 1)),
    ('zf', (0, 5), 'rest'),
    (('lb', (3, 0)), (1, 1),  'rest'),
)
# 第十回合：关羽左1上1使用焦热书烧吕布（此回合必须是晴天，否则撤兵重开），刘备左2下2休息，张飞右3下3攻击宋宪。
r[9] = (
    ('gy', (-1, -1), ('item', 'use', 0), (-1, -1)),
    (('lb', (4, 0)), (-2, 2),  'rest'),
    ('zf', (3, 3), 'attack', (1, 0)),
)
# 第十一回合：刘备下1使用焦热书烧宋宪（升到2级），张飞左1上2攻击宋宪，给他打回村庄，关羽继续原地使用焦热书烧吕布。
r[10] = (
    # (('lb', (2, 0)), (0, 1), ('item', 'use', 0), (-1, 1)),
    (('lb', (2, 0)), (-1, 1), 'attack', (0, 1)),
    (('zf', (1, 0)), (-1, -2), 'attack', (1, 0)),
    ('gy', (0, 0), ('item', 'use', 0), (-1, -1)),
)
# 第十二回合：张飞右1下2休息，刘备左1休息，关羽继续原地使用焦热书烧吕布。
r[11] = (
    # ('zf', (1, 2), 'rest'),
    ('zf', (1, 2), 'attack', (1, 0)),
    (('lb', (1, 0)), (0, 0), 'rest'),
    ('gy', (0, 0), ('item', 'use', 0), (-1, -1)),
)
# 第十三回合：张飞左1上2使用焦热书烧宋宪，刘备原地攻击宋宪，关羽下5攻击村庄里的张辽。
r[12] = (
    (('zf', (1, 0)), (-1, -2),  'attack', (1, 0)),
    (('lb', (1, 0)), (0, 0), 'rest'),
    ('gy', (0, 5), 'attack', (1, 0)),
)
# 第十四回合：张飞下2右1休息，刘备左1下3在张飞后面休息，关羽下1右1攻击张辽。
r[13] = (
    # ('zf', (1, 2), ('item', 'use', 2)),
    ('zf', (1, 2), 'rest'),
    (('lb', (1, 0)), (-1, 3), 'rest'),
    ('gy', (1, 1), 'attack', (0, -1)),
)
d[13] = 4
# 第十五回合：关羽下4休息，张飞左4使用豆给自己恢复兵力，刘备右1上1休息。
r[14] = (
    ('gy', (0, 4), 'rest'),
    # (('zf', (1, 0)), (-1, -2), ('item', 'use', 0), (1, 0)),
    (('zf', (1, 0)), (-4, 0), ('item', 'use', 2)),
    ('lb', (1, -1), 'rest'),
)
d[14] = 4
# 第十六回合：张飞右4攻击宋宪，关羽右4在村庄上方击退宋宪，刘备右1下1进入村庄休息。
r[15] = (
    ('zf', (4, 0), 'attack', (1, 0)),
    ('gy', (4, 0), 'attack', (0, 1)),
    (('lb', (1, 0)), (1, 1), 'rest'),
)
# 第十七回合：关羽上1左1攻击张辽，刘备左2休息，张飞左4上2休息。
r[16] = (
    (('gy', (2, 0)), (-1, -1), 'attack', (0, 1)),
    (('lb', (2, 0)), (-2, 0), 'rest'),
    (('zf', (1, 0)), (-4, -2), 'rest'),
)
# 第十八回合：吕布开始移动到下方村庄恢复兵力。刘备左2上2休息，关羽上1左3休息，张飞原地休息。
r[17] = (
    ('lb', (-2, -2), 'rest'),
    (('gy', (1, 0)), (-3, -1), 'rest'),
    ('zf', (0, 0), 'rest'),
)
# 第十九回合：刘备左2上1休息，其他人原地休息。
r[18] = (
    # ('lb', (-2, -1), ('item', 'use', 1), (1, 1)),
    ('lb', (-2, -1), 'rest'),
    ('gy', (0, 0), 'rest'),
    ('zf', (0, 0), 'rest'),
)
# 第二十回合：关羽右3下3攻击村庄里的张辽，其他人原地休息。
# 是否用豆？
r[19] = (
    ('gy', (3, 3), 'attack', (1, 0)),
    ('zf', (1, 0), ('item', 'use', 0), (-1, -1)),
    (('lb', (-1, 0)), (0, 0), 'attack', (1, 0)),
    # (('lb', (-1, 0)), (0, 0), 'rest'),
    # ('zf', (0, 0), ('item', 'use', 3)),
)
d[19] = 4
# 第二十一回合：关羽左3上3使用焦热书烧吕布，张飞右1使用焦热书烧吕布，刘备原地休息。
r[20] = (
    (('gy', (1, 0)), (0, 0), 'attack', (1, 0)),
    ('zf', (-1, 0), ('item', 'use', 2)),
    (('lb', (-1, 0)), (0, 0), 'rest'),
)
# 第二十二回合：张飞左1休息，刘备原地使用豆给张飞补充体力，关羽右3下3攻击张辽。
r[21] = (
    (('lb', (-1, 0)), (0, 0), 'rest'),
    ('zf', (0, 0), 'rest'),
    (('gy', (1, 0)), (-3, -3), 'rest'),
)
# 第二十三回合：关羽原地攻击张辽，其他人原地休息。
r[22] = (
    ('gy', (0, 0), ('item', 'use', 0), (-1, 0)),
    ('zf', (1, 0), ('item', 'use', 0), (-1, -1)),
    (('lb', (-1, 0)), (0, 0), 'attack', (1, 0)),
)
d[22] = 1
# 第二十四回合：关羽左3上3使用焦热书烧吕布，张飞右1使用焦热书烧吕布，刘备原地攻击吕布。
r[23] = (
    (('lb', (-1, 0)), (2, 2), ('item', 'use', 1), (0, -1)),
    ('gy', (3, 3), 'attack', (1, 0)),
    ('zf', (4, 1), 'attack', (0, 1)),
    # (('zf', (2, 0)), (0, -2), ('item', 'use', 0), (-1, 1)),
    # (('gy', (1, 0)), (0, 0), ('item', 'use', 0), (0, -1)),
    # (('lb', (2, 0)), (0, 1), 'rest'),
)
# 第二十五回合：刘备右3下1使用豆给张飞恢复兵力，张飞右3下2攻击张辽，关羽右4下2击退张辽，升到7级。
r[24] = (
    (('gy', (1, 0)), (0, 0), 'attack', (1, 0)),
    (('zf', (2, 0)), (0, 1), 'rest'),
    ('lb', (4, 0), 'rest'),
)
# 第二十六回合：张飞左1休息，刘备右2下2休息，关羽下1进入村庄补充兵力。
r[25] = (
    (('gy', (1, 0)), (-1, 0),  ('item', 'use', 0), (1, -1)),
    (('lb', (2, 0)), (0, 0), 'attack', (-1, 0)),
    (('zf', (2, 0)), (0, 0), ('item', 'use', 0), (-1, -1)),
)
d[25] = 1
# 第二十七回合：刘备原地攻击吕布，关羽上1攻击吕布，张飞右2进入村庄。
r[26] = (
    (('zf', (2, 0)), (-1, 0), 'rest'),
    (('lb', (2, 0)), (0, 1), ('item', 'send', 0), (-1, 0)),
    (('gy', (0, 0)), (2, -1), 'rest'),
)
# 第二十八回合：刘备右2休息，张飞左1休息，关羽下1进入村庄把焦热书传给张飞，同时祈祷下两个回合千万别是雨天（因为张飞这点经验，我打了一下午图片图片图片）
r[27] = (
    (('lb', (2, 0)), (0, 0), 'rest'),
    (('zf', (1, 0)), (0, 0), 'rest'),
    (('gy', (2, 0)), (0, 0), 'rest'),
)
# 第二十九回合：全体原地休息等候吕布。
r[28] = (
    (('gy', (2, 0)), (-2, 0), ('item', 'use', 0), (1, 0)),
    (('lb', (2, 0)), (0, -1), 'attack', (-1, 0)),
    (('zf', (1, 0)), (1, 0), ('item', 'use', 0), (-1, -1)),
)
d[28] = 1
# 第三十回合：刘备上1左1攻击吕布，张飞左1使用焦热书烧吕布，关羽左1击退吕布。
r[29] = (
    (('gy', (0, 0)), (-2, -4), 'attack', (0, -1)),
    (('lb', (2, 0)), (0, 1), 'rest'),
    (('zf', (2, 0)), (0, 0), 'rest'),
)

main(
    "D:\Games\sgzyjz\start.exe",
    ('lb', 'gy', 'zf'),
    rnd_list=r,
    delay_list=d,
)
